/* -----------------------------------------------------------------------------
* 파일 : 2577.c
* 기능 :백준-2577-숫자의 개수
* 개발자 : [F003], 202020678 김동준
* 개발 시작 : 2020-04-13
* 개발 종료 : 2020-04-13 (Pass)
*-------------------------------------------------------------------------------*/

#include<stdio.h>
#pragma warning (disable:4996)

int main() 
{

	int a,b,c, total = 1, count_array[10] = {0,};
	scanf("%d %d %d", &a, &b, &c);

	total = a * b * c;

	for (int i = 0; total > 0; i++)
	{
		a = total % 10;
		count_array[a] += 1;
		total /= 10;
	}
	for (int i = 0; i < 10; i++) 
	{
		printf("%d\n", count_array[i]);
	}
}

